def f_func(x: int|float) -> int|float:
    """
    Построение функции, для минимизации с особыми коэффициентами

    Ф*x^4 + И*x^2 + О*x

    1)  A    10) И    19) С    28) Ъ
    2)  Б    11) Й    20) Т    29) Ы
    3)  В    12) К    21) У    30) Ь
    4)  Г    13) Л    22) Ф    31) Э
    5)  Д    14) М    23) Х    32) Ю
    6)  Е    15) Н    24) Ц    33) Я
    7)  Ё    16) О    25) Ч
    8)  Ж    17) П    26) Ш
    9)  З    18) Р    27) Щ

    :param x:
    :return f_val(x):
    """

    return 19 * (x ** 4) + 10 * (x ** 2) + 10 * x

def df_func(x: int|float) -> int|float:
    """
    Аналитическая производная оригинальной функции

    :param x:
    :return df_val(x):
    """

    return 76 * (x ** 3) + 20 * x + 10
